{
  "main": {
    "name":"Neil Ferman",
    "description":"I am a web development and game programming engineer. I use Angular, react, react-native, Next, JavaScript, and Typescript to develop web pages. I also use Java Spring/Hibernate, C# .NET and ASP.NET to build backend servers, along with SQL to design databases.",
    "image":"profilepic.jpg",
    "bio":"With over 5 years of experience working in AGILE environments to set up mobile apps and webpages on large and small teams, I come equipped with knowledge of how to get a project done in a timely manner. I am also a game making hobbyist using Unity. I have set up Augmented Reality applications using sockets to communicate between a server and mobile app, as well as designed 2D games using the Corgi engine and More Mountains Topdown engine. I have also done some multiplayer games using MLAPI. I have hosted WebGL games on Angular and placed them in a virtual environment using the Aframe library (built off of Three.js). I have also used Serverless with Mongo and Python, as well as Angular to build an insurance claims app.",
    "contactmessage":"I am open for new experiences as a contracter, full time position, or freelance work. Contact me if you feel I can help you build a web app or video game engine.",
    "email": "nlferman83@gmail.com",
    "phone": "248-217-0264",
    "github":"https://github.com/nlferman",
    "project":"https://github.com/nlferman/SpaceStationNeedle",
    "address":{
      "street":"3641 Mark Road",
      "city":"Waterford",
      "state":"MI",
      "zip": "48328"
    },
    "resumedownload":"../public/Neil_Ferman_Resume_Full.docx",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/neil-ferman-aba36bb9/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/nlferman",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"",
    "education":[
      {
        "school":"Oakland University",
        "degree":"Bachelors of Computer Science",
        "graduated":"April 2018",
        "description":"President of the Video Game Making Club. Treasurer of the Board Game Design Club. Third place winner for Senior Project with AR-Top, a mobile app (Android and iOS) which used sockets to grab live updates of a map and render it in AR."
      },
      {
        "school":"Oakland University Internship",
        "degree":"Anatomy Learner",
        "graduated":"Game to help students learn anatomy",
        "description":"Drag and Drop game built in Unity to help students learn anatomy. Used a PHP server connected to a mySql database to store login information as well as high scores viewable by all students who played the game."
      }
    ],
    "work":[
      {
        "company":"Adroit Studio",
        "title": "Developer",
        "years": "May 2023 - Present",
        "description": "2 Player co-op Metroidvania game. Nutri-Quest is a 2D action platformer where players will work together to gather ingredients and when reaching a fireplace checkpoint, be able to cook those ingredients into meals and unlock new abilities when they gain enough nutritional points (protein, carbs, etc). Built in Unity with C#, game has several enemy varieties and two player types (a tank and a speed character) for different ability types and variety of gameplay. Nutri-Quest is designed to be fun and educational with a target audience of middle schoolers."
      },
      {
        "company":"Kavliro",
        "title":"Software Developer",
        "years":"October 2022 - March 2023",
        "description":"Full stack position that utilized Serverless, Mongo, Python on the backend, and Angular on the front end in order to create a claims service to allow customers and insurance adjusters to view insurance claims and make communication of insurance concerns easy to access."
      },
      {
        "company":"Xperience Communications",
        "title":"Software Developer",
        "years":"March 2021 - September 2022",
        "description":"Built call center training game in Unity and Angular to train employees to handle customer calls, using the A-Frame library to handle 3D tour environments. Strapi DB used to track user logins, progress, and high scores. Also configured Android App used to register people attending on-site events using Android Studio. Used Unity to connect RFID scanner to application to read data from a short range and display it on screen."
      },
      {
        "company":"Ricardo Defense",
        "title":"Software Developer",
        "years":"September 2020 - December 2020",
        "description":"Set up API endpoints using ASP.net. Executed powershell scripts to run automatically with cron schedules to capture Windows and Linux user information to be recorded in a database."
      },
      {
        "company":"Sam's Club",
        "title":"Software Engineer I",
        "years":"August 2018 - September 2020",
        "description":"Designed mobile application with react-native. Refactored code from JavaScript to TypeScript for better readability, extensibility, and modularity. Set up both Saga and GraphQL endpoints to communicate with Java Spring backend. Built API backend with Java Spring and Hibernate. Deployed Java and React projects to Microsoft Azure using Jenkins for CI/CD automation."
      }
    ],
    "skills":[
      {
        "name":"Languages / Frameworks: Angular, React, Spring, Java, Android, Hibernate, Oracle SQL, TypeScript",
        "level":"100%"
      },
      {
        "name":"Unity: C#, socketio, Vuforia AR, Corgi Engine, More Mountains Topdown Engine, MLAPI, Animator, Cinemachine, Particle System, VFX Graph, Shader Graph, URP Lighting",
        "level":"100%"
      },
      {
        "name":"C#: .Net, Singleton Pattern, Fly-Weight Pattern, Observables, Lambda Expressions, Linq, Loops, Strings, Lists, Arrays",
        "level":"100%"
      },
      {
        "name":"Web Technologies: Angular, React, Next, AWS, HTML/CSS, JavaScript, TypeScript, Microservices",
        "level":"100%"
      },
      {
        "name":"Middleware: Spring MVC, Java, AJAX, Servlet API, JDBC, Hibernate",
        "level":"100%"
      },
      {
        "name":"Testing: Jenkins, Jasmine, Postman, Karma, JUnit, SonarQube, ESLint",
        "level":"100%"
      },
      {
        "name":"Back-End: Java, Spring Data, AWS EC2, Hibernate, Oracle SQL, JDBC, Mongo, Python",
        "level":"100%"
      },
      {
        "name":"Devops: GitHub, Maven, Jenkins, Jasmine, SonarQube, AWS, Azure, Servless",
        "level":"100%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title": "Nutri-Quest",
        "category": "(No github for NDA purposes but enjoy the video of my boss trying it for the first time). 2D Platformer Metroidvania with 2 player co-op. Built in Unity with C#.",
        "image": "nutriquest.png",
        "url": "https://www.youtube.com/watch?v=hDOqqNkcTuQ"
      },
      {
        "title":"DTE CX Arcade",
        "category":"(No github for NDA purposes). Built using a combination of Unity, Angular, A-frame, and Strapi. This project has a variety of content including a scavenger hunt using 3D environments to hide items the user should look for. It also has a Unity WebGL embedded into it with different stages for the user to play in.",
        "image":"DTE_Virtual_CX_Arcade.png",
        "url":"#"
      },
      {
        "title":"Quick Pick",
        "category":"(No Github for NDA purposes) Sam's Club's mobile app for store associates to pick customer's online orders. Customer orders come in over a live feed, store associates are able to open the order, see the list of items the customer ordered, and they would be able to scan the item as picked, and place the item in a container, then store the container. Later, when the customer arrived, the order could then be dispensed to the customer, and the customer would be charged for their order.",
        "image":"QuickPick1.jpg",
        "url":"#"
      },
      {
        "title":"AR-Top",
        "category":"(Inactive) Mobile app that used sockets to get live updates from a server to display a map in Augmented Reality. I worked on the Augmented Reality using Unity and Vuforia. Users could scan an QR target to bring up a premade layout, that could be updated live using web-sockets. This could be used to run a Tabletop game using Augmented Reality (AR).",
        "image":"Artop_demo1.png",
        "url":"https://github.com/nlferman/AR-Top"
      },
      {
        "title":"Space Station Needle",
        "category":"Unity project using More Mountains Top Down engine to create a small dual-stick shooter with jump, hover, and other powerups. This is a Reverse-Metroidvania style of game, where the user must give up powerups they start with to activate environmental features for the space station they need to navigate. For example, in the video the user gives up their jetpack which has limited hover, to activate moving platforms which can traverse much larger pits.",
        "image":"Space Station Needle 2 - Tile Sample.png",
        "url":"https://github.com/nlferman/SpaceStationNeedle"
      },
      {
        "title":"Anatomy Learner",
        "category":"Video Game to aid medical students to learn anatomy and compete with each other to get high scores. Users can drag and drop muscles to their correct placements, as well as answer quiz questions. Scores are based on both time and accuracy, allowing users to compete with each other to improve their ability to study and retain information by turning learning into a fun little game.",
        "image":"Screenshot1_LevelSelect.png",
        "url":"https://bitbucket.org/goeteeks/iiltanatomy/src/master/"
      },
      {
        "title":"Arrow Adventure",
        "category":"Part of the 2018 Game Jam hosted by Mark Brown (Game Maker's Toolkit). Theme of game was to Move while Attacking. Little bow and arrow could be charged up and aimed with the mouse to launch bow while it held onto its arrow to propel it in any direction. Enemies could only be damaged when arrow moved with enough velocity.",
        "image":"Arrow_Adventure_1.png",
        "url":"https://github.com/nlferman/Arrow-Adventure"
      },
      {
        "title":"Glitch Garden",
        "category":"Plants Vs Zombies clone where players defended against a few types of enemies. Some that could jump or fly over certain defenses. Star flowers give energy, energy is used to spawn more flowers or other plants to help defend your garden from the creatures seeking to attack it.",
        "image":"Glitch_Garden.png",
        "url":"https://github.com/nlferman/GlitchGarden"
      },
      {
        "title":"Laser Defender",
        "category":"An Arkanoid clone where user controls a ship left and right and shoots at enemies to destroy them. User has three lives, where earning 10,000 points awards an extra life. A and D moves the ship, SPACEBAR shoots lasers. Avoid being shot at, defeat all of the enemies, survive for as long as you can.",
        "image":"Laser_Defender.png",
        "url":"https://github.com/nlferman/LaserDefender"
      }
    ]
  }
}
